package homeWork.homeWork7;

public class DefinitelyAnimals {
    //1)Необходимо построить иерархию из животных,умеющих издавать специфичные звуки(на примере,кошек,собак,попугаев и прочих)
//2)Необходимо создать массив общего предка Animal с вызовом полиморфной операции voice всех животных данного массива
//(с простым выводом издаваемого звука в консоль)
    //Задаю переменные,как в уроке использовать "private" пока не вижу смысла
    String name;//Добавил пару лишних чтобы выглядело не так скучно
    String voice;
    int age;
}
